"""
author: mary
date: 23.07.31
title: 최대공약수
"""
import sys
input = sys.stdin.readline

def 최대공약수(a, b):
    if b == 0:
        return a
    return 최대공약수(b, a % b)

A, B = list(map(int, input().split()))
gcd = 최대공약수(A, B)

### 문자 출력 -> 메모리, 시간 = 44180, 48
print('1'*gcd)
### 문자열 출력 -> 메모리, 시간 = 77332, 1908
[print("1", end = "") for i in range(gcd)]


# 11 11 - 11
# 11 111(3*37) - 1
# 11 1111(11*101) - 11
# 11 11111(41*271) - 1
# 11 111111(3*7*11*13*37) - 11

# 2 2222 - 2
# 222(2*3*37) 22222(2*41*272)

# 111111111 111 9, 3 = 3
# 222222222(2*3*3*37*333667) 222(2*3*37)


